request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:api="http://webservices.business.bruuser.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <api:getAll>
            <userName>acontell</userName>
            <password>3dFc4x5pasd</password>
        </api:getAll>
    </soapenv:Body>
</soapenv:Envelope>